{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[0],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Variable","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[1],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Add/y","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"shape":{"shape":{"dim":[]}}},"name":"inc","op":"Placeholder"},{"input":[],"attr":{"dtype":{"type":3},"shape":{"shape":{"dim":[]}}},"name":"init","op":"Placeholder"},{"input":[],"attr":{"dtype":{"type":3},"shape":{"shape":{"dim":[]}}},"name":"times","op":"Placeholder"},{"input":[],"attr":{"dtype":{"type":3},"shape":{"shape":{"dim":[]}}},"name":"times2","op":"Placeholder"},{"input":["Variable"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/Enter_4","op":"Enter"},{"input":["inc"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/Enter_3","op":"Enter"},{"input":["init"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/Enter","op":"Enter"},{"input":["times"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/Enter_1","op":"Enter"},{"input":["times2"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/Enter_2","op":"Enter"},{"input":["while/Enter_4","while/NextIteration_4"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/Merge_4","op":"Merge"},{"input":["while/Enter_3","while/NextIteration_3"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/Merge_3","op":"Merge"},{"input":["while/Enter","while/NextIteration"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/Merge","op":"Merge"},{"input":["while/Enter_1","while/NextIteration_1"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/Merge_1","op":"Merge"},{"input":["while/Enter_2","while/NextIteration_2"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/Merge_2","op":"Merge"},{"input":["while/Merge","while/Merge_1"],"attr":{"T":{"type":3}},"name":"while/Less","op":"Less"},{"input":["while/Less"],"attr":{},"name":"while/LoopCond","op":"LoopCond"},{"input":["while/Merge_3","while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/Switch_3","op":"Switch"},{"input":["while/Merge_2","while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/Switch_2","op":"Switch"},{"input":["while/Merge","while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/Switch","op":"Switch"},{"input":["while/Merge_1","while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/Switch_1","op":"Switch"},{"input":["while/Merge_4","while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/Switch_4","op":"Switch"},{"input":["while/Switch_3:1"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/while/Enter_2","op":"Enter"},{"input":["while/Switch_2:1"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/while/Enter_1","op":"Enter"},{"input":["while/Switch:1"],"attr":{"T":{"type":3}},"name":"while/Identity","op":"Identity"},{"input":["while/Switch_1:1"],"attr":{"T":{"type":3}},"name":"while/NextIteration_1","op":"NextIteration"},{"input":["while/Switch_4:1"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/while/Enter_3","op":"Enter"},{"input":["while/Switch_4"],"attr":{"T":{"type":3}},"name":"while/Exit_4","op":"Exit"},{"input":["while/while/Enter_2","while/while/NextIteration_2"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/while/Merge_2","op":"Merge"},{"input":["while/while/Enter_1","while/while/NextIteration_1"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/while/Merge_1","op":"Merge"},{"input":["^while/Identity"],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[0],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"while/Const","op":"Const"},{"input":["^while/Identity"],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[1],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"while/Add/y","op":"Const"},{"input":["while/while/Enter_3","while/while/NextIteration_3"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/while/Merge_3","op":"Merge"},{"input":["while/Exit_4","Add/y"],"attr":{"T":{"type":3}},"name":"Add","op":"Add"},{"input":["while/Const"],"attr":{"T":{"type":3},"is_constant":{"b":false},"parallel_iterations":{"i":"10"},"frame_name":{"s":[119,104,105,108,101,47,119,104,105,108,101,47,119,104,105,108,101,95,99,111,110,116,101,120,116]}},"name":"while/while/Enter","op":"Enter"},{"input":["while/Identity","while/Add/y"],"attr":{"T":{"type":3}},"name":"while/Add","op":"Add"},{"input":["while/while/Enter","while/while/NextIteration"],"attr":{"T":{"type":3},"N":{"i":"2"}},"name":"while/while/Merge","op":"Merge"},{"input":["while/Add"],"attr":{"T":{"type":3}},"name":"while/NextIteration","op":"NextIteration"},{"input":["while/while/Merge","while/while/Merge_1"],"attr":{"T":{"type":3}},"name":"while/while/Less","op":"Less"},{"input":["while/while/Less"],"attr":{},"name":"while/while/LoopCond","op":"LoopCond"},{"input":["while/while/Merge_2","while/while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/while/Switch_2","op":"Switch"},{"input":["while/while/Merge","while/while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/while/Switch","op":"Switch"},{"input":["while/while/Merge_1","while/while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/while/Switch_1","op":"Switch"},{"input":["while/while/Merge_3","while/while/LoopCond"],"attr":{"T":{"type":3}},"name":"while/while/Switch_3","op":"Switch"},{"input":["while/while/Switch_2"],"attr":{"T":{"type":3}},"name":"while/while/Exit_2","op":"Exit"},{"input":["while/while/Switch_2:1"],"attr":{"T":{"type":3}},"name":"while/while/NextIteration_2","op":"NextIteration"},{"input":["while/while/Switch:1"],"attr":{"T":{"type":3}},"name":"while/while/Identity","op":"Identity"},{"input":["while/while/Switch_1"],"attr":{"T":{"type":3}},"name":"while/while/Exit_1","op":"Exit"},{"input":["while/while/Switch_1:1"],"attr":{"T":{"type":3}},"name":"while/while/NextIteration_1","op":"NextIteration"},{"input":["while/while/Switch_3:1","while/while/Switch_2:1"],"attr":{"T":{"type":3}},"name":"while/while/Add_1","op":"Add"},{"input":["while/while/Switch_3"],"attr":{"T":{"type":3}},"name":"while/while/Exit_3","op":"Exit"},{"input":["while/while/Exit_2"],"attr":{"T":{"type":3}},"name":"while/NextIteration_3","op":"NextIteration"},{"input":["^while/while/Identity"],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[1],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"while/while/Add/y","op":"Const"},{"input":["while/while/Exit_1"],"attr":{"T":{"type":3}},"name":"while/NextIteration_2","op":"NextIteration"},{"input":["while/while/Add_1"],"attr":{"T":{"type":3}},"name":"while/while/NextIteration_3","op":"NextIteration"},{"input":["while/while/Exit_3"],"attr":{"T":{"type":3}},"name":"while/NextIteration_4","op":"NextIteration"},{"input":["while/while/Identity","while/while/Add/y"],"attr":{"T":{"type":3}},"name":"while/while/Add","op":"Add"},{"input":["while/while/Add"],"attr":{"T":{"type":3}},"name":"while/while/NextIteration","op":"NextIteration"}],"library":{"function":[],"gradient":[]},"versions":{"badConsumers":[]}},"weightsManifest":[{"weights":[{"name":"Variable","dtype":"int32","shape":[]},{"name":"Add/y","dtype":"int32","shape":[]},{"name":"while/Const","dtype":"int32","shape":[]},{"name":"while/Add/y","dtype":"int32","shape":[]},{"name":"while/while/Add/y","dtype":"int32","shape":[]}],"paths":["group1-shard1of1"]}]}