{"weightsManifest": [{"weights": [{"dtype": "float32", "name": "ConstantFolding/Postprocessor/Decode/div_recip", "shape": []}, {"dtype": "float32", "name": "Postprocessor/ExpandDims", "shape": [1, 1917, 4]}, {"dtype": "float32", "name": "ConstantFolding/Postprocessor/Decode/div_4_recip", "shape": []}, {"dtype": "int32", "name": "Postprocessor/Reshape_1/shape", "shape": [2]}, {"dtype": "float32", "name": "ConstantFolding/Postprocessor/Decode/div_2_recip", "shape": []}, {"dtype": "float32", "name": "BoxPredictor_0/BoxEncodingPredictor_depthwise/depthwise_weights", "shape": [3, 3, 576, 1]}, {"dtype": "float32", "name": "BoxPredictor_0/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [576]}, {"dtype": "float32", "name": "BoxPredictor_0/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [576]}, {"dtype": "float32", "name": "BoxPredictor_0/BoxEncodingPredictor/weights", "shape": [1, 1, 576, 12]}, {"dtype": "float32", "name": "BoxPredictor_0/BoxEncodingPredictor/biases", "shape": [12]}, {"dtype": "float32", "name": "BoxPredictor_1/BoxEncodingPredictor_depthwise/depthwise_weights", "shape": [3, 3, 1280, 1]}, {"dtype": "float32", "name": "BoxPredictor_1/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [1280]}, {"dtype": "float32", "name": "BoxPredictor_1/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [1280]}, {"dtype": "float32", "name": "BoxPredictor_1/BoxEncodingPredictor/weights", "shape": [1, 1, 1280, 24]}, {"dtype": "float32", "name": "BoxPredictor_1/BoxEncodingPredictor/biases", "shape": [24]}, {"dtype": "float32", "name": "BoxPredictor_2/BoxEncodingPredictor_depthwise/depthwise_weights", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "BoxPredictor_2/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [512]}, {"dtype": "float32", "name": "BoxPredictor_2/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [512]}, {"dtype": "float32", "name": "BoxPredictor_2/BoxEncodingPredictor/weights", "shape": [1, 1, 512, 24]}, {"dtype": "float32", "name": "BoxPredictor_2/BoxEncodingPredictor/biases", "shape": [24]}, {"dtype": "float32", "name": "BoxPredictor_3/BoxEncodingPredictor_depthwise/depthwise_weights", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "BoxPredictor_3/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_3/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_3/BoxEncodingPredictor/weights", "shape": [1, 1, 256, 24]}, {"dtype": "float32", "name": "BoxPredictor_3/BoxEncodingPredictor/biases", "shape": [24]}, {"dtype": "float32", "name": "BoxPredictor_4/BoxEncodingPredictor_depthwise/depthwise_weights", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "BoxPredictor_4/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_4/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_4/BoxEncodingPredictor/weights", "shape": [1, 1, 256, 24]}, {"dtype": "float32", "name": "BoxPredictor_4/BoxEncodingPredictor/biases", "shape": [24]}, {"dtype": "float32", "name": "BoxPredictor_5/BoxEncodingPredictor_depthwise/depthwise_weights", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "BoxPredictor_5/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [128]}, {"dtype": "float32", "name": "BoxPredictor_5/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [128]}, {"dtype": "float32", "name": "BoxPredictor_5/BoxEncodingPredictor/weights", "shape": [1, 1, 128, 24]}, {"dtype": "float32", "name": "BoxPredictor_5/BoxEncodingPredictor/biases", "shape": [24]}, {"dtype": "int32", "name": "MultipleGridAnchorGenerator/assert_equal/x", "shape": []}, {"dtype": "int32", "name": "BoxPredictor_0/stack/3", "shape": []}, {"dtype": "int32", "name": "Postprocessor/ExpandDims_1/dim", "shape": []}, {"dtype": "float32", "name": "BoxPredictor_0/ClassPredictor_depthwise/depthwise_weights", "shape": [3, 3, 576, 1]}, {"dtype": "float32", "name": "BoxPredictor_0/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [576]}, {"dtype": "float32", "name": "BoxPredictor_0/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [576]}, {"dtype": "float32", "name": "BoxPredictor_0/ClassPredictor/weights", "shape": [1, 1, 576, 273]}, {"dtype": "float32", "name": "BoxPredictor_0/ClassPredictor/biases", "shape": [273]}, {"dtype": "int32", "name": "BoxPredictor_0/stack/1", "shape": []}, {"dtype": "float32", "name": "BoxPredictor_1/ClassPredictor_depthwise/depthwise_weights", "shape": [3, 3, 1280, 1]}, {"dtype": "float32", "name": "BoxPredictor_1/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [1280]}, {"dtype": "float32", "name": "BoxPredictor_1/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [1280]}, {"dtype": "float32", "name": "BoxPredictor_1/ClassPredictor/weights", "shape": [1, 1, 1280, 546]}, {"dtype": "float32", "name": "BoxPredictor_1/ClassPredictor/biases", "shape": [546]}, {"dtype": "int32", "name": "BoxPredictor_1/stack/1", "shape": []}, {"dtype": "float32", "name": "BoxPredictor_2/ClassPredictor_depthwise/depthwise_weights", "shape": [3, 3, 512, 1]}, {"dtype": "float32", "name": "BoxPredictor_2/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [512]}, {"dtype": "float32", "name": "BoxPredictor_2/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [512]}, {"dtype": "float32", "name": "BoxPredictor_2/ClassPredictor/weights", "shape": [1, 1, 512, 546]}, {"dtype": "float32", "name": "BoxPredictor_2/ClassPredictor/biases", "shape": [546]}, {"dtype": "int32", "name": "BoxPredictor_2/stack/1", "shape": []}, {"dtype": "float32", "name": "BoxPredictor_3/ClassPredictor_depthwise/depthwise_weights", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "BoxPredictor_3/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_3/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_3/ClassPredictor/weights", "shape": [1, 1, 256, 546]}, {"dtype": "float32", "name": "BoxPredictor_3/ClassPredictor/biases", "shape": [546]}, {"dtype": "int32", "name": "BoxPredictor_3/stack/1", "shape": []}, {"dtype": "float32", "name": "BoxPredictor_4/ClassPredictor_depthwise/depthwise_weights", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "BoxPredictor_4/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_4/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [256]}, {"dtype": "float32", "name": "BoxPredictor_4/ClassPredictor/weights", "shape": [1, 1, 256, 546]}, {"dtype": "float32", "name": "BoxPredictor_4/ClassPredictor/biases", "shape": [546]}, {"dtype": "int32", "name": "BoxPredictor_4/stack/1", "shape": []}, {"dtype": "float32", "name": "BoxPredictor_5/ClassPredictor_depthwise/depthwise_weights", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "BoxPredictor_5/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled", "shape": [128]}, {"dtype": "float32", "name": "BoxPredictor_5/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset", "shape": [128]}, {"dtype": "float32", "name": "BoxPredictor_5/ClassPredictor/weights", "shape": [1, 1, 128, 546]}, {"dtype": "float32", "name": "BoxPredictor_5/ClassPredictor/biases", "shape": [546]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/project/BatchNorm/batchnorm/sub", "shape": [160]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/expand/Conv2D/merged_input", "shape": [1, 1, 160, 960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/expand/BatchNorm/batchnorm/sub", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/depthwise_weights", "shape": [3, 3, 960, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/BatchNorm/batchnorm/mul", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/BatchNorm/batchnorm/sub", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/project/Conv2D/merged_input", "shape": [1, 1, 960, 160]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/project/BatchNorm/batchnorm/sub", "shape": [160]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/expand/Conv2D/merged_input", "shape": [1, 1, 160, 960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/expand/BatchNorm/batchnorm/sub", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/depthwise_weights", "shape": [3, 3, 960, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/BatchNorm/batchnorm/mul", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/BatchNorm/batchnorm/sub", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/project/Conv2D/merged_input", "shape": [1, 1, 960, 160]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/project/BatchNorm/batchnorm/sub", "shape": [96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Conv2D/merged_input", "shape": [1, 1, 96, 576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/BatchNorm/batchnorm/sub", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise_weights", "shape": [3, 3, 576, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/batchnorm/mul", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/batchnorm/sub", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/project/Conv2D/merged_input", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/batchnorm/sub", "shape": [96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D/merged_input", "shape": [1, 1, 96, 576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/batchnorm/sub", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise_weights", "shape": [3, 3, 576, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/batchnorm/mul", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/batchnorm/sub", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D/merged_input", "shape": [1, 1, 576, 96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/batchnorm/sub", "shape": [64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D/merged_input", "shape": [1, 1, 64, 384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise_weights", "shape": [3, 3, 384, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/batchnorm/mul", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D/merged_input", "shape": [1, 1, 384, 64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/batchnorm/sub", "shape": [64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D/merged_input", "shape": [1, 1, 64, 384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise_weights", "shape": [3, 3, 384, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/batchnorm/mul", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D/merged_input", "shape": [1, 1, 384, 64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/batchnorm/sub", "shape": [64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D/merged_input", "shape": [1, 1, 64, 384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise_weights", "shape": [3, 3, 384, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/batchnorm/mul", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D/merged_input", "shape": [1, 1, 384, 64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/batchnorm/sub", "shape": [32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D/merged_input", "shape": [1, 1, 32, 192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/batchnorm/sub", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise_weights", "shape": [3, 3, 192, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/batchnorm/mul", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/batchnorm/sub", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D/merged_input", "shape": [1, 1, 192, 32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/batchnorm/sub", "shape": [32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D/merged_input", "shape": [1, 1, 32, 192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/batchnorm/sub", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights", "shape": [3, 3, 192, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/batchnorm/mul", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/batchnorm/sub", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D/merged_input", "shape": [1, 1, 192, 32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/batchnorm/sub", "shape": [24]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D/merged_input", "shape": [1, 1, 24, 144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/batchnorm/sub", "shape": [144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights", "shape": [3, 3, 144, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/batchnorm/mul", "shape": [144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/batchnorm/sub", "shape": [144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D/merged_input", "shape": [1, 1, 144, 24]}, {"dtype": "float32", "name": "Preprocessor/mul/x", "shape": []}, {"dtype": "int32", "name": "Preprocessor/map/TensorArrayStack/range/start", "shape": []}, {"dtype": "float32", "name": "Preprocessor/sub/y", "shape": []}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/Conv/Conv2D/merged_input", "shape": [3, 3, 3, 32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/Conv/BatchNorm/batchnorm/sub", "shape": [32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise_weights", "shape": [3, 3, 32, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/batchnorm/mul", "shape": [32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/batchnorm/sub", "shape": [32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D/merged_input", "shape": [1, 1, 32, 16]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/batchnorm/sub", "shape": [16]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D/merged_input", "shape": [1, 1, 16, 96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/batchnorm/sub", "shape": [96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights", "shape": [3, 3, 96, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/batchnorm/mul", "shape": [96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/batchnorm/sub", "shape": [96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D/merged_input", "shape": [1, 1, 96, 24]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/batchnorm/sub", "shape": [24]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D/merged_input", "shape": [1, 1, 24, 144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/batchnorm/sub", "shape": [144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights", "shape": [3, 3, 144, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/batchnorm/mul", "shape": [144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/batchnorm/sub", "shape": [144]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D/merged_input", "shape": [1, 1, 144, 32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/batchnorm/sub", "shape": [32]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D/merged_input", "shape": [1, 1, 32, 192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/batchnorm/sub", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise_weights", "shape": [3, 3, 192, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/batchnorm/mul", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/batchnorm/sub", "shape": [192]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D/merged_input", "shape": [1, 1, 192, 64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/batchnorm/sub", "shape": [64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D/merged_input", "shape": [1, 1, 64, 384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise_weights", "shape": [3, 3, 384, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/batchnorm/mul", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/batchnorm/sub", "shape": [384]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D/merged_input", "shape": [1, 1, 384, 96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/batchnorm/sub", "shape": [96]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/expand/Conv2D/merged_input", "shape": [1, 1, 96, 576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/expand/BatchNorm/batchnorm/sub", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/depthwise/depthwise_weights", "shape": [3, 3, 576, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/depthwise/BatchNorm/batchnorm/mul", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/depthwise/BatchNorm/batchnorm/sub", "shape": [576]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/project/Conv2D/merged_input", "shape": [1, 1, 576, 160]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_13/project/BatchNorm/batchnorm/sub", "shape": [160]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/expand/Conv2D/merged_input", "shape": [1, 1, 160, 960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/expand/BatchNorm/batchnorm/sub", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/depthwise/depthwise_weights", "shape": [3, 3, 960, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/depthwise/BatchNorm/batchnorm/mul", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/depthwise/BatchNorm/batchnorm/sub", "shape": [960]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/project/Conv2D/merged_input", "shape": [1, 1, 960, 320]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/expanded_conv_16/project/BatchNorm/batchnorm/sub", "shape": [320]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/Conv_1/Conv2D/merged_input", "shape": [1, 1, 320, 1280]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/Conv_1/BatchNorm/batchnorm/sub", "shape": [1280]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_2_1x1_256/Conv2D/merged_input", "shape": [1, 1, 1280, 256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_2_1x1_256/BatchNorm/batchnorm/sub", "shape": [256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_2_3x3_s2_512_depthwise/depthwise_weights", "shape": [3, 3, 256, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_2_3x3_s2_512_depthwise/BatchNorm/batchnorm/mul", "shape": [256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_2_3x3_s2_512_depthwise/BatchNorm/batchnorm/sub", "shape": [256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_2_3x3_s2_512/Conv2D/merged_input", "shape": [1, 1, 256, 512]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_2_3x3_s2_512/BatchNorm/batchnorm/sub", "shape": [512]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_3_1x1_128/Conv2D/merged_input", "shape": [1, 1, 512, 128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_3_1x1_128/BatchNorm/batchnorm/sub", "shape": [128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_3_3x3_s2_256_depthwise/depthwise_weights", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_3_3x3_s2_256_depthwise/BatchNorm/batchnorm/mul", "shape": [128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_3_3x3_s2_256_depthwise/BatchNorm/batchnorm/sub", "shape": [128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_3_3x3_s2_256/Conv2D/merged_input", "shape": [1, 1, 128, 256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_3_3x3_s2_256/BatchNorm/batchnorm/sub", "shape": [256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_4_1x1_128/Conv2D/merged_input", "shape": [1, 1, 256, 128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_4_1x1_128/BatchNorm/batchnorm/sub", "shape": [128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_4_3x3_s2_256_depthwise/depthwise_weights", "shape": [3, 3, 128, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_4_3x3_s2_256_depthwise/BatchNorm/batchnorm/mul", "shape": [128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_4_3x3_s2_256_depthwise/BatchNorm/batchnorm/sub", "shape": [128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_4_3x3_s2_256/Conv2D/merged_input", "shape": [1, 1, 128, 256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_4_3x3_s2_256/BatchNorm/batchnorm/sub", "shape": [256]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_5_1x1_64/Conv2D/merged_input", "shape": [1, 1, 256, 64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_1_Conv2d_5_1x1_64/BatchNorm/batchnorm/sub", "shape": [64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_5_3x3_s2_128_depthwise/depthwise_weights", "shape": [3, 3, 64, 1]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_5_3x3_s2_128_depthwise/BatchNorm/batchnorm/mul", "shape": [64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_5_3x3_s2_128_depthwise/BatchNorm/batchnorm/sub", "shape": [64]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_5_3x3_s2_128/Conv2D/merged_input", "shape": [1, 1, 64, 128]}, {"dtype": "float32", "name": "FeatureExtractor/MobilenetV2/layer_19_2_Conv2d_5_3x3_s2_128/BatchNorm/batchnorm/sub", "shape": [128]}, {"dtype": "int32", "name": "Postprocessor/strided_slice/stack", "shape": [1]}, {"dtype": "int32", "name": "Postprocessor/strided_slice/stack_1", "shape": [1]}, {"dtype": "int32", "name": "BoxPredictor_5/stack/1", "shape": []}, {"dtype": "int32", "name": "BoxPredictor_0/stack_1/2", "shape": []}, {"dtype": "int32", "name": "Postprocessor/Tile/multiples/1", "shape": []}, {"dtype": "int32", "name": "Postprocessor/Slice/begin", "shape": [3]}, {"dtype": "int32", "name": "Postprocessor/Slice/size", "shape": [3]}, {"dtype": "int32", "name": "Preprocessor/map/while/ResizeImage/ExpandDims/dim", "shape": []}, {"dtype": "int32", "name": "Preprocessor/map/while/ResizeImage/stack", "shape": [2]}, {"dtype": "int32", "name": "Preprocessor/map/while/add/y", "shape": []}, {"dtype": "int32", "name": "Postprocessor/Decode/transpose/sub_1", "shape": [2]}, {"dtype": "int32", "name": "Postprocessor/Decode/get_center_coordinates_and_sizes/transpose/sub_1", "shape": [2]}, {"dtype": "int32", "name": "Postprocessor/Decode/transpose_1/sub_1", "shape": [2]}], "paths": ["group1-shard1of5", "group1-shard2of5", "group1-shard3of5", "group1-shard4of5", "group1-shard5of5"]}], "modelTopology": {"node": [{"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "op": "Const", "name": "ConstantFolding/Postprocessor/Decode/div_recip"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1917"}, {"size": "4"}]}}}}, "op": "Const", "name": "Postprocessor/ExpandDims"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "op": "Const", "name": "ConstantFolding/Postprocessor/Decode/div_4_recip"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}, "op": "Const", "name": "Postprocessor/Reshape_1/shape"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}, "op": "Const", "name": "ConstantFolding/Postprocessor/Decode/div_2_recip"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_0/BoxEncodingPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "op": "Const", "name": "BoxPredictor_0/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "op": "Const", "name": "BoxPredictor_0/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "12"}]}}}}, "op": "Const", "name": "BoxPredictor_0/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}}, "op": "Const", "name": "BoxPredictor_0/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_1/BoxEncodingPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}, "op": "Const", "name": "BoxPredictor_1/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}, "op": "Const", "name": "BoxPredictor_1/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_1/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_1/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_2/BoxEncodingPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "op": "Const", "name": "BoxPredictor_2/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "op": "Const", "name": "BoxPredictor_2/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_2/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_2/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_3/BoxEncodingPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_3/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_3/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_3/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_3/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_4/BoxEncodingPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_4/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_4/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_4/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_4/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_5/BoxEncodingPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "op": "Const", "name": "BoxPredictor_5/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "op": "Const", "name": "BoxPredictor_5/BoxEncodingPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_5/BoxEncodingPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}}, "op": "Const", "name": "BoxPredictor_5/BoxEncodingPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "MultipleGridAnchorGenerator/assert_equal/x"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "BoxPredictor_0/stack/3"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "Postprocessor/ExpandDims_1/dim"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_0/ClassPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "op": "Const", "name": "BoxPredictor_0/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "op": "Const", "name": "BoxPredictor_0/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "273"}]}}}}, "op": "Const", "name": "BoxPredictor_0/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "273"}]}}}}, "op": "Const", "name": "BoxPredictor_0/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "BoxPredictor_0/stack/1"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_1/ClassPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}, "op": "Const", "name": "BoxPredictor_1/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}}, "op": "Const", "name": "BoxPredictor_1/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_1/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_1/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "BoxPredictor_1/stack/1"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_2/ClassPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "op": "Const", "name": "BoxPredictor_2/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}, "op": "Const", "name": "BoxPredictor_2/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "512"}, {"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_2/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_2/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "BoxPredictor_2/stack/1"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_3/ClassPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_3/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_3/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_3/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_3/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "BoxPredictor_3/stack/1"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_4/ClassPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_4/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}, "op": "Const", "name": "BoxPredictor_4/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "256"}, {"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_4/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_4/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}, "op": "Const", "name": "BoxPredictor_4/stack/1"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "1"}]}}}}, "op": "Const", "name": "BoxPredictor_5/ClassPredictor_depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "op": "Const", "name": "BoxPredictor_5/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Scaled"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}, "op": "Const", "name": "BoxPredictor_5/ClassPredictor_depthwise/BatchNorm/FusedBatchNorm/Offset"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_5/ClassPredictor/weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "546"}]}}}}, "op": "Const", "name": "BoxPredictor_5/ClassPredictor/biases"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/project/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/expand/Conv2D/merged_input"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/expand/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/BatchNorm/batchnorm/mul"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/depthwise/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_15/project/Conv2D/merged_input"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/project/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/expand/Conv2D/merged_input"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/expand/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/BatchNorm/batchnorm/mul"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/depthwise/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_14/project/Conv2D/merged_input"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/project/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/Conv2D/merged_input"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/expand/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/depthwise_weights"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/batchnorm/mul"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/depthwise/BatchNorm/batchnorm/sub"}, {"attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}}, "op": "Const", "name": "FeatureExtractor/MobilenetV2/expanded_conv_12/project/Conv2D/merged_input"}, 